app/views/cart/_cart.html.erb

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
SELECT COUNT(*) FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
---
  <%= turbo_frame_tag "cart" do %>
    <% if @cart.orderables.count > 0 %>