app/views/cart/_orderables.html.erb

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
SELECT COUNT(*) FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
---
<% if @cart.orderables.count > 0 %>

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
---
  <div class="list-cart">
    <% @cart.orderables.each do |orderable| %>