app/controllers/cart_controller.rb

  def add
    @product = Product.find_by(id: params[:id])
    quantity = params[:quantity].to_i
    current_orderable = @cart.orderables.find_by(product_id: @product.id)
    if current_orderable && quantity > 0
      current_orderable.update(quantity:)
    elsif quantity <= 0
      current_orderable.destroy
    else
      @cart.orderables.create(product: @product, quantity:)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ? AND "orderables"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = ?, "updated_at" = ? WHERE "orderables"."id" = ?  [["quantity", 3], ["updated_at", "2024-02-29 06:39:46.407470"], ["id", 1]]
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 3]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 495], ["LIMIT", 1]]
INSERT INTO "orderables" ("product_id", "cart_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["quantity", 1], ["created_at", "2024-02-29 06:39:38.720683"], ["updated_at", "2024-02-29 06:39:38.720683"]]

  def add_quantity
    @product = Product.find_by(id: params[:id])
    quantity = params[:quantity].to_i

    current_orderable = @cart.orderables.find_by(params[product_id: @product])
    current_orderable.quantity += 1
    current_orderable.save
---
SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ? LIMIT ?  [["cart_id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = ?, "updated_at" = ? WHERE "orderables"."id" = ?  [["quantity", 2], ["updated_at", "2024-03-01 21:08:37.927555"], ["id", 477]]

  def reduce_quantity
    @product = Product.find_by(id: params[:id])
    quantity = params[:quantity].to_i
    current_orderable = @cart.orderables.find_by(params[:id])
    if current_orderable.quantity > 1
      current_orderable.quantity -= 1
      current_orderable.save
    else
      current_orderable.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ? LIMIT ?  [["cart_id", 2], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = ?, "updated_at" = ? WHERE "orderables"."id" = ?  [["quantity", 1], ["updated_at", "2024-03-01 21:08:39.377148"], ["id", 477]]
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 477]]

  def remove
    @cart_details = Orderable.find(params[:id])
    @cart_details.destroy
---
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 478], ["LIMIT", 1]]
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 478]]