app/controllers/cart_controller.rb

SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 490], ["LIMIT", 1]]
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 78]]
---
  def reduce_quantity
    quantity = params[:quantity].to_i
    current_orderable = Orderable.find(params[:id])
    if current_orderable.quantity > 1
      current_orderable.quantity -= 1
      current_orderable.save(quantity:)
    else
      current_orderable.destroy